#+TITLE: Automatic Generation of Travel-time Maps
#+AUTHOR: Axel Forsch
#+EMAIL:     (concat "forsch" at-sign "igg.uni-bonn.de")
#+LANGUAGE:  en
#+SETUPFILE: /home/axel/org/org-html-themes/setup/theme-readtheorg.setup

** Running the code
The source code contains the class =main.Main.java= which serves as the
main class for running the code. The behavior of the program is
controlled by command line arguments passed to this main class or the
pre-compiled jar-file.  To run the program, navigate to the directory
containing =traveltimes.jar= and execute the following comand:

#+BEGIN_SRC sh
java -jar traveltimes.jar -dr [path-to-road-shp] -dg [path-to-gtfs-dir] -s [id-of-startnode]
#+END_SRC

Shown are the three mandatory input parameters =-dr=, =-dg= and =-s= used to
specify the path to the input data and the node index of the starting
node in the road network for the travel-time map. To retrieve the node
index for a specific location you have two options: the first option
utilizes the GUI, for this leave away parameter =-s= and add parameter
=-r= to shows the GUI without calculating a time-zone. Clicking on a
location on the map displays the node index of the closest road node
in the top left corner of the frame. The second option is to enter the
coordinates of desired starting points in a csv-file with each line
formatted as =x,y=, passing the file with parameter =-f=. Here is an
example:

#+BEGIN_SRC sh :dir /home/axel/Documents/002_Isochrones/travel-time_maps/docs/documentation/ :exports both :results output
  java -jar traveltimes.jar -dr ./data/03_roadBornheim/BornheimUTM.shp -dg ./data/03_gtfsBornheim -f ./data/start_locations.csv
#+END_SRC

#+RESULTS:
: Searching node indices:
:   node not found
:   found 27291

Note that only nodes in a radius of 15 meters around the specified
location are returned. For the given example the first location does
not yield a valid node. To start a query from the second node, use =-s
27291=.

To enable the GUI to show results, use the flag =-r=. Otherwise results
can only be inspected by opening the output files created.

